# 자료형


# 숫자형, 문자형

1

2

10

100


# 문자형: 문자, 문자열

"Hello"

"안녕하세요"

'c'

'a'

print("Hello" + " World")

print("*")
print("*")
print("*")
print("*")
print("*")
print("*")

print("*" * 6)


# Online Python - IDE, Editor, Compiler, Interpreter
print("___________                        _________                      __  .__    .__                 ")
print("\__    ___/__.__.______   ____    /   _____/ ____   _____   _____/  |_|  |__ |__| ____    ____   ")
print("|    | <   |  |\____ \_/ __ \   \_____  \ /  _ \ /     \_/ __ \   __\  |  \|  |/    \  / ___\  ")
print("|    |  \___  ||  |_> >  ___/   /        (  <_> )  Y Y  \  ___/|  | |   Y  \  |   |  \/ /_/  > ")
print("|____|  / ____||   __/ \___  > /_______  /\____/|__|_|  /\___  >__| |___|  /__|___|  /\___  /  ")
print("          \/     |__|        \/          \/             \/     \/          \/        \//_____/   ")

b = 1



a = [1, 2, 3, 'test']
  
print(a)

# 인덱싱

# 리스트에서 값을 하나만 선택해서 뽑고 싶을 때 사용

print(a[2])

print(a[0])
print(a[1])

# 부분만 추출하고 싶을 때 슬라이싱 개념을 이용

print(a[0:4])

# n번째

# 위치: (n-1)


  



